RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm33/board/board.c
/*
 * Copyright 2021-2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <rthw.h>
#include <rtthread.h>

#include "drv_uart.h"

#include "fsl_common.h"
#include "board.h"
#if defined(SDK_NETC_USED) && SDK_NETC_USED
    #include "fsl_netc_soc.h"
    #include "fsl_netc_ierb.h"
#endif /* SDK_NETC_USED */
#include "fsl_iomuxc.h"
#include "fsl_cache.h"
#include "fsl_ele_base_api.h"
#include "fsl_dcdc.h"
#include "fsl_trdc.h"
#include "fsl_rgpio.h"

#ifdef BSP_USING_ETH
#include "fsl_netc_endpoint.h"
#include "fsl_netc_switch.h"
#include "fsl_netc_mdio.h"
#endif

#ifdef BSP_USE_MULTICORE
#include "mcmgr.h"
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define NVIC_PRIORITYGROUP_0         0x00000007U /*!< 0 bits for pre-emption priority
                                                      4 bits for subpriority */
#define NVIC_PRIORITYGROUP_1         0x00000006U /*!< 1 bits for pre-emption priority
                                                      3 bits for subpriority */
#define NVIC_PRIORITYGROUP_2         0x00000005U /*!< 2 bits for pre-emption priority
                                                      2 bits for subpriority */
#define NVIC_PRIORITYGROUP_3         0x00000004U /*!< 3 bits for pre-emption priority
                                                      1 bits for subpriority */
#define NVIC_PRIORITYGROUP_4         0x00000003U /*!< 4 bits for pre-emption priority
                                                      0 bits for subpriority */ 

#define BOARD_FLEXSPI_DLL_LOCK_RETRY (10)

#ifdef BSP_USE_MULTICORE
#define ENABLE_CM7_TCM_ECC 0U

/*
 * This workaround is used for kick-off CM7 when CM7 image vector table is not
 * at 0x0 and CM7 TCM ECC fuse is set(1).
 * When CM7 TCM ECC fuse is unset(0), this workaround is useless and no side
 * effect when applied.
 */
#define ENABLE_WORKAROUND_CM7_KICK_OFF 1U

#define CONTAINER_BASE_ADDR   0x38001000UL /* For FlexSPI, base addr(0x38000000) + 0x1000 offset */
#define CONTAINER_MAX_NUM     2U
#define CONTAINER_SIZE        0x400U /* in bytes */
#define CONTAINER_HEADER_SIZE 16U    /* in bytes */
#define IMAGE_ENTRY_SIZE      0x80U  /* in bytes */
#define IMAGE_TAG_NUM         0x87U
#define IMAGE_TYPE_EXECUTABLE 0x03U
#define CORE_ID_CM7           0x02U

#define CM7_ITCM_START_ADDR              0x0UL      /* from pespective of CM7 */
#define CM7_ITCM_END_ADDR                0x80000UL  /* from pespective of CM7 */
#define CM7_ITCM_SIZE                    0x80000UL  /* from pespective of CM7 */
#define CM7_ITCM_ADDR_MAP_AT_CM33_DOMAIN 0x303C0000 /* from pespective of CM33 */
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/

AT_QUICKACCESS_SECTION_DATA(volatile uint32_t g_systickCounter);

/*******************************************************************************
 * Code
 ******************************************************************************/

#ifdef BSP_USE_MULTICORE
/*!
 * @brief Get CM7 Image Address and size information from container header
 *
 * Container Header structure are shown as the following
 *
 *         31                    23                   15                   7                   0
 *         +--------------------+--------------------+--------------------+--------------------+
 *     0x0 |     Tag (0x87)     |                  Length                 |   Version (0x00)   |
 *         +--------------------+--------------------+--------------------+--------------------+
 *     0x4 |                                      SRK Flags                                    |
 *         +--------------------+--------------------+--------------------+--------------------+
 *     0x8 |  Num of Images     |   Fuse Version     |                 SW Version              |
 *         +--------------------+--------------------+--------------------+--------------------+
 *     0xC |         R          |                 Signature Block Offset                       |
 *         +--------------------+--------------------+--------------------+--------------------+
 *         |                                                                                   |
 *     +   |                                  Image Array Entry                                |
 *         |                                                                                   |
 *         +--------------------+--------------------+--------------------+--------------------+
 *         |                                                                                   |
 *     +   |                                   Signature Block                                 |
 *         |                                                                                   |
 *         +--------------------+--------------------+--------------------+--------------------+
 *
 * Its' image entry are further layout as the following
 *
 *                             +0x4                 +0x8                 +0xC
 *         +--------------------+--------------------+--------------------+--------------------+
 *     0x0 |   Image Offset     |    Image Size      |            Load Address                 |
 *         +--------------------+--------------------+--------------------+--------------------+
 *    0x10 |                Entry Point              |      Flags         |       Meta         |
 *         +--------------------+--------------------+--------------------+--------------------+
 *    0x20 |                                                                                   |
 *         |                                        HASH                                       |
 *         |                                                                                   |
 *         +--------------------+--------------------+--------------------+--------------------+
 *    0x60 |                                         R                                         |
 *         +--------------------+--------------------+--------------------+--------------------+
 *
 * Its' Flag contains the Image Type and Core
 *
 *         31                    23                   15         11        7         3         0
 *         +--------------------+--------------------+----------+---------+----------+---------+
 *   Flags |                             R                      |   H/E   |   Core   |   Type  |
 *         +--------------------+--------------------+--------------------+----------+---------+
 *
 * The function iterate through each container header and its image entries until it find
 * CM7 Exexutable Image. The information of the image is then returned to user
 *
 * More information can be found in RM "System Boot" Chapter
 *
 * @param pImageSrcAddr CM7 Image Srouce Address from CM33 perspective
 * @param pImageDestAddr CM7 Image Destination Address from CM33 perspective
 * @param pImageSize CM7 Image Size
 * @param pImageBootAddr CM7 Image Load Address from CM7 prespective
 */
status_t BOARD_GetCore1ImageAddrSize(uint32_t *pImageSrcAddr,
                                     uint32_t *pImageDestAddr,
                                     uint32_t *pImageSize,
                                     uint32_t *pImageBootAddr)
{
    /* parser the container to get the CM7 image location and size */

    uint32_t i, j;

    uint32_t image_src_addr  = 0U;
    uint32_t image_dest_addr = 0U;
    uint32_t image_size      = 0U;
    uint32_t image_boot_addr = 0U;

