RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm33/board/board.c
    status_t ret = kStatus_Fail;

    uint32_t *pContainer = (uint32_t *)CONTAINER_BASE_ADDR;

    for (i = 0U; i < CONTAINER_MAX_NUM; i++)
    {
        uint32_t image_num, image_tag = pContainer[0] >> 24U;

        if (image_tag != IMAGE_TAG_NUM)
        {
            break;
        }

        image_num = pContainer[2] >> 24U;
        if (image_num >= 2U)
        {
            uint32_t *pImage = &pContainer[CONTAINER_HEADER_SIZE / sizeof(uint32_t)];
            for (j = 0U; j < image_num; j++)
            {
                uint32_t image_type = pImage[6] & 0xFU;
                uint32_t image_core = (pImage[6] >> 4U) & 0xFU;

                if ((image_type == IMAGE_TYPE_EXECUTABLE) && (image_core == CORE_ID_CM7))
                {
                    /* pImage[0] is the image offset, which is based on current container header */
                    image_src_addr  = ((uint32_t)pContainer) + pImage[0];
                    image_size      = pImage[1];
                    image_dest_addr = pImage[2];
                    image_boot_addr = pImage[4];
                    ret             = kStatus_Success;
                    break;
                }

                pImage += IMAGE_ENTRY_SIZE / sizeof(uint32_t);
            }
        }

        pContainer += CONTAINER_SIZE / sizeof(uint32_t);
    }

    if (pImageSrcAddr != NULL)
    {
        *pImageSrcAddr = image_src_addr;
    }

    if (pImageDestAddr != NULL)
    {
        *pImageDestAddr = image_dest_addr;
    }

    if (pImageSize != NULL)
    {
        *pImageSize = image_size;
    }

    if (pImageBootAddr != NULL)
    {
        *pImageBootAddr = image_boot_addr;
    }

    return ret;
}

/*
 * image_src_addr image_dest_addr is address from perspective of core0(CM33)
 * boot_addr is address from perspective of core1(CM7)
 */
void BOARD_PrepareCore1(uint32_t image_src_addr, uint32_t image_dest_addr, uint32_t image_size, uint32_t boot_addr)
{
    /* The Cortex M7 XIP image runs from NOR Flash  */
    if ((boot_addr >= CM7_ITCM_END_ADDR) || ((CM7_ITCM_START_ADDR > 0U) && (boot_addr < CM7_ITCM_START_ADDR)))
    {
        /* Out of CM7 ITCM address space, CM7 core and its TCM ECC probably not initialized yet, do it here */
        Prepare_CM7(boot_addr);

#if (defined(ENABLE_WORKAROUND_CM7_KICK_OFF) && (ENABLE_WORKAROUND_CM7_KICK_OFF > 0U))
        /*
         * When CM7 TCM ECC fuse is set(1)
         *   ROM will powerup CM7 domain, CM7 VTOR is settled(always 0) only when powerup,
         *   so CM33 image has no chance to update CM7 VTOR. Thus those CM7 image with
         *   vector table is not located at 0x0, boot fails.
         *   The workaround here, is to copy two header word of image vector(normally SP
         *   and Reset_Handler) to CM7 initial VTOR addr(0x0), as a fake vector table and stepping-stone,
         *   then CM7 boot successfully.
         *
         * Note:
         *   1. The fake vector table is one-time used, memory(0x0~0x07) is released when CM7
         *      starts to execute Reset_Handler.
         *   2. CM7 Reset_Handler will update CM7 VTOR to real vector addr of the CM7 image.
         *   3. The workaround doesn't take effect(also no side effect), when CM7 TCM ECC fuse is set(0)
         */
        uint32_t *pRamVect  = (uint32_t *)CM7_ITCM_ADDR_MAP_AT_CM33_DOMAIN;
        uint32_t *pBootVect = (uint32_t *)boot_addr;
        pRamVect[0]         = pBootVect[0];
        pRamVect[1]         = pBootVect[1];
#endif /* (defined(ENABLE_WORKAROUND_CM7_KICK_OFF) && (ENABLE_WORKAROUND_CM7_KICK_OFF > 0U)) */
    }
    /* The Cortex M7 image runs from internal ITCM RAM  */
    else
    {
#if ENABLE_CM7_TCM_ECC
		/* Do noting, CM7 image has been copied by ROM */
#else			
        Prepare_CM7(boot_addr);
        /* Copy CM7 image from FLASH to CM7 ITCM */
        if ((image_size > 0) && (image_size < CM7_ITCM_SIZE))
        {
            /* Use memcpy to copy the image */
            (void)memcpy((void *)CM7_ITCM_ADDR_MAP_AT_CM33_DOMAIN, (void *)image_src_addr, image_size);
            
            /* Ensure data is written to memory before CM7 starts */
            __DSB();
            __ISB();
        }
#endif
    }
}
#endif

/* MPU configuration. */
#if __CORTEX_M == 7
void BOARD_ConfigMPU(void)
{
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
    extern uint32_t Image$$RW_m_ncache$$Base[];
    /* RW_m_ncache_aux is a auxiliary region which is used to get the whole size of noncache section */
    extern uint32_t Image$$RW_m_ncache_aux$$Base[];
    uint32_t nonCacheStart = (uint32_t)Image$$RW_m_ncache$$Base;
    uint32_t nonCacheSize  = ((uint32_t)Image$$RW_m_ncache_aux$$Base) - nonCacheStart;
#elif defined(__MCUXPRESSO)
    extern uint32_t __base_NCACHE_REGION;
    extern uint32_t __top_NCACHE_REGION;
    uint32_t nonCacheStart = (uint32_t)(&__base_NCACHE_REGION);
    uint32_t nonCacheSize  = (uint32_t)(&__top_NCACHE_REGION) - nonCacheStart;
#elif defined(__ICCARM__) || defined(__GNUC__)
    extern uint32_t __NCACHE_REGION_START[];
    extern uint32_t __NCACHE_REGION_SIZE[];
    uint32_t nonCacheStart = (uint32_t)__NCACHE_REGION_START;
    uint32_t nonCacheSize  = (uint32_t)__NCACHE_REGION_SIZE;
#endif
#if defined(__USE_SHMEM)
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
    extern uint32_t Image$$RPMSG_SH_MEM$$Base[];
    /* RPMSG_SH_MEM_aux is a auxiliary region which is used to get the whole size of RPMSG_SH_MEM section */
    extern uint32_t Image$$RPMSG_SH_MEM_aux$$Base[];
    uint32_t rpmsgShmemStart = (uint32_t)Image$$RPMSG_SH_MEM$$Base;
    uint32_t rpmsgShmemSize  = ((uint32_t)Image$$RPMSG_SH_MEM_aux$$Base) - rpmsgShmemStart;
#elif defined(__MCUXPRESSO)
    extern uint32_t __base_SHMEM_REGION;
    extern uint32_t __top_SHMEM_REGION;
    uint32_t rpmsgShmemStart = (uint32_t)(&__base_SHMEM_REGION);
    uint32_t rpmsgShmemSize  = (uint32_t)(&__top_SHMEM_REGION) - rpmsgShmemStart;
#elif defined(__ICCARM__) || defined(__GNUC__)
    extern uint32_t __RPMSG_SH_MEM_START[];
    extern uint32_t __RPMSG_SH_MEM_SIZE[];
    uint32_t rpmsgShmemStart = (uint32_t)__RPMSG_SH_MEM_START;
    uint32_t rpmsgShmemSize  = (uint32_t)__RPMSG_SH_MEM_SIZE;
#endif
#endif
    volatile uint32_t i;

    /* Disable I cache and D cache */
    L1CACHE_DisableICache();
    L1CACHE_DisableDCache();

    /* Disable MPU */
    ARM_MPU_Disable();

    /* clang-format off */

    /* MPU configure:
     * Use ARM_MPU_RASR(DisableExec, AccessPermission, TypeExtField, IsShareable, IsCacheable, IsBufferable, SubRegionDisable, Size)
     * API in mpu_armv7.h.
     * param DisableExec       Instruction access (XN) disable bit,0=instruction fetches enabled, 1=instruction fetches disabled.
     * param AccessPermission  Data access permissions, allows you to configure read/write access for User and Privileged mode.
     *                         Use MACROS defined in mpu_armv7.h:
     *                         ARM_MPU_AP_NONE/ARM_MPU_AP_PRIV/ARM_MPU_AP_URO/ARM_MPU_AP_FULL/ARM_MPU_AP_PRO/ARM_MPU_AP_RO
     *
     * Combine TypeExtField/IsShareable/IsCacheable/IsBufferable to configure MPU memory access attributes.
     *  TypeExtField  IsShareable  IsCacheable  IsBufferable   Memory Attribute    Shareability        Cache
     *     0             x           0           0             Strongly Ordered    shareable
     *     0             x           0           1              Device             shareable
     *     0             0           1           0              Normal             not shareable   Outer and inner write
     *                                                                                             through no write allocate
     *     0             0           1           1              Normal             not shareable   Outer and inner write
     *                                                                                             back no write allocate
     *     0             1           1           0              Normal             shareable       Outer and inner write
     *                                                                                             through no write allocate
     *     0             1           1           1              Normal             shareable       Outer and inner write
     *                                                                                             back no write allocate
     *     1             0           0           0              Normal             not shareable   outer and inner
     *                                                                                             noncache
     *     1             1           0           0              Normal             shareable       outer and inner
     *                                                                                             noncache
     *     1             0           1           1              Normal             not shareable   outer and inner write
     *                                                                                             back write/read acllocate
     *     1             1           1           1              Normal             shareable       outer and inner write
     *                                                                                             back write/read acllocate
     *     2             x           0           0              Device             not shareable
     *   Above are normal use settings, if your want to see more details or want to config different inner/outer cache
     * policy, please refer to Table 4-55 /4-56 in arm cortex-M7 generic user guide <dui0646b_cortex_m7_dgug.pdf>
     *
     * param SubRegionDisable  Sub-region disable field. 0=sub-region is enabled, 1=sub-region is disabled.
     * param Size              Region size of the region to be configured. use ARM_MPU_REGION_SIZE_xxx MACRO in mpu_armv7.h.
     */

    /* clang-format on */

