RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm33/board/board.c
static bool TRDC_IsValidDomain(TRDC_Type *trdc, uint8_t domain)
{
    bool r = true;

    if ((domain > 11) || (domain < 2) || (domain == 3))
    {
        r = false;
    }
    return r;
}

static bool TRDC_IsValidMbc(TRDC_Type *trdc, uint8_t mbc)
{
    bool r = false;
    if (trdc == TRDC1)
    {
        switch (mbc)
        {
        case 0: /* TRDC1 MBC_A0   */
        case 1: /* TRDC1 MBC_A1   */
            r = true;
            break;
        default:
            break;
        }
    }
    else if (trdc == TRDC2)
    {
        switch (mbc)
        {
        case 0: /* TRDC2 MBC_W0   */
        case 1: /* TRDC2 MBC_W1   */
            r = true;
            break;
        default:
            break;
        }
    }
    return r;
}

static uint32_t TRDC_GetMbcMemNum(TRDC_Type *trdc, uint32_t mbc)
{
    uint32_t memNumber = 0U;
    if (trdc == TRDC1)
    {
        uint8_t MemNum[2] = {3, 2};
        switch (mbc)
        {
        case 0: /* TRDC1 MBC_A0 AIPS1/Edgelock/GPIO1      */
        case 1: /* TRDC1 MBC_A1 CM33 Code-TCM/CM33 System-TCM     */
            memNumber = MemNum[mbc];
            break;
        default:
            break;
        }
    }
    else if (trdc == TRDC2)
    {
        uint8_t MemNum[2] = {4, 4};
        switch (mbc)
        {
        case 0: /* TRDC2 MBC_A0 AIPS2/GPIO2, GPIO4, GPIO6/GPIO3, GPIO5/DAP (Debug) */
        case 1: /* TRDC2 MBC_A1 AIPS3/AHB_ISPAP/NIC_MAIN GPV/SRAMC                 */
            memNumber = MemNum[mbc];
            break;
        default:
            break;
        }
    }
    return memNumber;
}

static bool TRDC_IsValidMbcMem(TRDC_Type *trdc, uint8_t mbc, uint8_t mem)
{
    bool r = false;
    if (trdc == TRDC1)
    {
        switch (mbc)
        {
        case 0: /* TRDC1 MBC_A0                      */
            switch (mem)
            {
            case 0: /* TRDC1 MBC_A0 AIPS1                */
                r = true;
                break;
            case 1: /* TRDC1 MBC_A0 Edgelock             */
                break; /* Intentional, Edgelock region not touched. */
            case 2: /* TRDC1 MBC_A0 GPIO1                */
                r = true;
                break;
            default:
                break;
            }
            break;
        case 1: /* TRDC1 MBC_A1                        */
            switch (mem)
            {
            case 0: /* TRDC1 MBC_A1 CM33 Code-TCM          */
            case 1: /* TRDC1 MBC_A1 CM33 System-TCM        */
                r = true;
                break;
            default:
                break;
            }
            break;
        default:
            break;
        }
    }
    else if (trdc == TRDC2)
    {
        switch (mbc)
        {
        case 0: /* TRDC2 MBC_W0                        */
            switch (mem)
            {
            case 0: /* TRDC2 MBC_W0 AIPS2                  */
            case 1: /* TRDC2 MBC_W0 GPIO2, GPIO4, GPIO6    */
            case 2: /* TRDC2 MBC_W0 GPIO3, GPIO5           */
            case 3: /* TRDC2 MBC_W0 DAP (Debug)            */
                r = true;
                break;

            default:
                break;
            }
            break;
        case 1: /* TRDC2 MBC_W1                         */
            switch (mem)
            {
            case 0: /* TRDC2 MBC_W1 AIPS3                  */
            case 1: /* TRDC2 MBC_W1 AHB_ISPAP              */
            case 2: /* TRDC2 MBC_W1 NIC_MAIN GPV           */
            case 3: /* TRDC2 MBC_W1 SRAMC                  */
                r = true;
                break;

            default:
                break;
            }
            break;
        default:
            break;
        }
    }
    return r;
}

static bool TRDC_IsValidMrc(TRDC_Type *trdc, uint8_t mrc)
{
    bool r = false;
    if (trdc == TRDC1)
    {
        switch (mrc)
        {
        case 0: /* TRDC1 MRC_A0   */
        case 1: /* TRDC1 MRC_A1   */
            r = true;
            break;
        default:
            break;
        }
    }
    else if (trdc == TRDC2)
    {
        switch (mrc)
        {
        case 1: /* TRDC2 MRC_W1   */
        case 2: /* TRDC2 MRC_W2   */
        case 3: /* TRDC2 MRC_W3   */
        case 4: /* TRDC2 MRC_W4   */
        case 5: /* TRDC2 MRC_W5   */
        case 6: /* TRDC2 MRC_W6   */
            r = true;
            break;
        default:
            break;
        }
    }
    return r;
}

static bool TRDC_GetMrcRegionAddr(TRDC_Type *trdc, uint8_t mrc, uint32_t *pStartAddr, uint32_t *pStopAddr)
{
    bool r = true;
    if (trdc == TRDC1)
    {
        switch (mrc)
        {
        case 0: /* TRDC1 MRC_A0 CM33 ROM  */
            *pStartAddr = 0x00000000UL;
            *pStopAddr  = 0x00027FFFUL;
            break;
        case 1: /* TRDC1 MRC_A1 FlexSPI2  */
            *pStartAddr = 0x04000000UL;
            *pStopAddr  = 0x07FFFFFFUL;
            break;
        default:
            r = false;
            break;
        }
    }
    else if (trdc == TRDC2)
    {
        switch (mrc)
        {
        case 1: /* TRDC2 MRC_W1 FlexSPI1         */
            *pStartAddr = 0x28000000UL;
            *pStopAddr  = 0x2FFFFFFFUL;
            break;
        case 2: /* TRDC2 MRC_W2 CM7 I-TCM D-TCM  */
            *pStartAddr = 0x203C0000UL;
            *pStopAddr  = 0x2043FFFFUL;
            break;
        case 3: /* TRDC2 MRC_W3 OCRAM1           */
            *pStartAddr = 0x20480000UL;
            *pStopAddr  = 0x204FFFFFUL;
            break;
        case 4: /* TRDC2 MRC_W4 OCRAM2           */
            *pStartAddr = 0x20500000UL;
            *pStopAddr  = 0x2053FFFFUL;
            break;
        case 5: /* TRDC2 MRC_W5 SEMC             */
            *pStartAddr = 0x80000000UL;
            *pStopAddr  = 0x8FFFFFFFUL;
            break;
        case 6: /* TRDC2 MRC_W6 NETC             */
            *pStartAddr = 0x60000000UL;
            *pStopAddr  = 0x60FFFFFFUL;
            break;
        default:
            r = false;
            break;
        }
    }
    return r;
}

